FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC2478/CARRIER_LPC2478.c
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_PLLConfigure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the PLL
 *---------------------------------------------------------------------------*/
void UEZBSP_PLLConfigure(void)
{
    const T_LPC2478_PLL_Frequencies freq_CPU120MHz_Peripheral60Mhz_USB48MHz = {
            12000000,

            // Run PLL0 at 72 MHz
            72000000,

            // CPU Clock is PLL0 / 1 or 72 MHz / 1 = 72 MHz
            1,

            // PCLK is PLL0 / 1, or 72 MHz
            1,

            // EMC runs at PLL0 / 1, or 72 MHz
            1,

            // USB Clock = 48 MHz
            1,

            };
    LPC2478_PLL_SetFrequencies(&freq_CPU120MHz_Peripheral60Mhz_USB48MHz);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_InterruptsReset
 *---------------------------------------------------------------------------*
 * Description:
 *      Do the first initialization of the interrupts.
 *---------------------------------------------------------------------------*/
void UEZBSP_InterruptsReset(void)
{
    InterruptsReset();
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_CPU_PinConfigInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Immediately configure the port pins
 *---------------------------------------------------------------------------*/
void UEZBSP_CPU_PinConfigInit(void)
{
    // Place any pin configuration that MUST be initially here (at power up
    // but before even SDRAM is initialized)
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_FatalError
 *---------------------------------------------------------------------------*
 * Description:
 *      A fatal error in uEZ will come here last.  We must turn off
 *      interrupts and put the platform in a halted state with a blinking
 *      LED.
 * Inputs:
 *      int aErrorCode -- Blink the LED a number of times equal to
 *          the error code.
 *---------------------------------------------------------------------------*/
 #if (COMPILER_TYPE == IAR)
__interwork __arm void UEZBSP_FatalError_ARM(int aErrorCode)
#else
void UEZBSP_FatalError_ARM(int aErrorCode)
#endif
{
    register TUInt32 i;
    register TUInt32 count;

    // Ensure interrupts are turned off
    portDISABLE_INTERRUPTS();

    // Configure status led to be fully in our control
    // Make P4.23 be a GPIO pin
    PINSEL9 &= ~(3<<14);
    // and an output pin
    FIO4DIR |= (1<<23);

    // Blink our status led in a pattern, forever
    count = 0;
    while (1) {
        FIO4CLR |= (1<<23); // on
        for (i=0; i<2000000; i++)
            NOP();
        FIO4SET |= (1<<23); // off
        for (i=0; i<2000000; i++)
            NOP();
        count++;
        if (count >= aErrorCode) {
            // Long pause
            for (i=0; i<10000000; i++)
                NOP();
            count = 0;
        }
    }
}

void UEZBSP_FatalError(int aErrorCode)
{
    UEZBSP_FatalError_ARM(aErrorCode);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_I2C0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2C0 device driver
 *---------------------------------------------------------------------------*/
void UEZPlatform_I2C0_Require(void)
{
    DEVICE_CREATE_ONCE();

    // Ensure the I2C0 exists in the HAL level
    LPC2478_GPIO0_Require();
    LPC2478_I2C0_Require(GPIO_P0_27, GPIO_P0_28);
    I2C_Generic_Create("I2C0", "I2C0", 0);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_I2C2_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2C2 device driver.  Usually only used when connecting
 *      to the external header.
 *---------------------------------------------------------------------------*/
void UEZPlatform_I2C2_Require(void)
{
    DEVICE_CREATE_ONCE();

    // Ensure the I2C2 exists in the HAL level
    LPC2478_GPIO0_Require();
    LPC2478_I2C2_Require(GPIO_P4_20, GPIO_P4_21);
    I2C_Generic_Create("I2C2", "I2C2", 0);

}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Temp0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Temperature0 device driver.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Temp0_Require(void)
{
    DEVICE_CREATE_ONCE();

    UEZPlatform_I2C0_Require();
    Temp_NXP_LM75A_Create("Temp0", "I2C0", 0x92 >> 1);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Accel0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Accelerometer 0 device driver.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Accel0_Require(void)
{
    DEVICE_CREATE_ONCE();

    UEZPlatform_I2C0_Require();
#if (FDI_PLATFORM == CARRIER_R4)
    Accelerometer_Freescale_MMA7455_I2C_Create("Accel0", "I2C0",
            MMA7455_I2C_ADDR);
#else
    Bosch_Accelerometer_BMA150_Create("Accel0", "I2C0");
#endif
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_GPDMAx_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the General Purpose DMA drivers.
 *---------------------------------------------------------------------------*/
void UEZPlatform_GPDMA0_Require(void)
{
    DEVICE_CREATE_ONCE();

