FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC2478/CARRIER_LPC2478.c
            GPIO_NONE,  // LCD_CLKIN
    };
    T_halWorkspace *p_lcdc;
    T_uezDeviceWorkspace *p_lcd;
    T_uezDevice backlight;
    T_uezDeviceWorkspace *p_backlight;
    extern const T_uezDeviceInterface *UEZ_LCD_INTERFACE_ARRAY[];
    T_uezDevice lcd;

    DEVICE_CREATE_ONCE();
    LPC2478_GPIO1_Require();
    LPC2478_GPIO2_Require();
    LPC2478_GPIO4_Require();
    LPC2478_LCDController_Require(&pins);
    UEZPlatform_Backlight_Require();

    // Need to register LCD device and use existing LCD Controller
    UEZDeviceTableRegister(
            "LCD",
            (T_uezDeviceInterface *)UEZ_LCD_INTERFACE_ARRAY[UEZ_LCD_COLOR_DEPTH],
            0,
            &p_lcd);

    HALInterfaceFind("LCDController", &p_lcdc);
    UEZDeviceTableFind("Backlight", &backlight);
    UEZDeviceTableGetWorkspace(backlight, (T_uezDeviceWorkspace **)&p_backlight);
#if (UEZ_DEFAULT_LCD_CONFIG==LCD_CONFIG_OKAYA_QVGA_3x5_LCDC_3_5)
    UEZPlatform_SSP0_Require();
    LCD_RH320240T_Create("LCD", "SSP0", GPIO_P2_11,GPIO_P2_0,GPIO_P2_4);
#elif (UEZ_DEFAULT_LCD_CONFIG==LCD_CONFIG_KOE_TX13D06VM2BAA)
    LCD_TX13D06VM2BAA_Create("LCD", GPIO_P2_4, GPIO_P2_0, GPIO_P2_11, GPIO_NONE, GPIO_NONE);
#endif
    ((DEVICE_LCD *)(p_lcd->iInterface))->Configure(
            p_lcd,
            (HAL_LCDController **)p_lcdc,
            LCD_DISPLAY_BASE_ADDRESS,
            (DEVICE_Backlight **)p_backlight);

    // Open the LCD now! Before the USB Device initializes!
    // This is a fix to the initialization order of the LCD in reference to the
    // order of the USB Device driver.  LCD *MUST* be initialized before USB Device!
    // The problem is with the USB_ATX_INT interrupt signal in USBIntSt register.
    // If the USB Device tries to come up while P1.27 is SetMux to 1 (it is both
    // LCDVD[12], LCDVD[20], and USB_INT1 rolled into 1), the USB_ATX_INT will
    // be set and keep being set.  The solution is to make sure the LCD is
    // fully initialized so the USB_INT1 pin function is overridden.  Since any
    // user requires LCD is going to open the LCD, this is a harmless command
    // that powers up the LCD.  It will show nothing until the LCD backlight
    // is turned on.  It is left off.
    // -- lshields 4/1/2013
    UEZLCDOpen("LCD", &lcd);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Timer0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Timer0 drivers, but don't set any capture sources or
 *      match registers.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Timer0_Require(void)
{
    static const T_LPC2478_Timer_Settings settings = {
            GPIO_NONE,      // T0_CAP[0]
            GPIO_NONE,      // T0_CAP[1]
            GPIO_NONE,      // T0_MAT[0]
            GPIO_NONE,      // T0_MAT[1]
            GPIO_NONE,      // T0_MAT[2]
            GPIO_NONE,      // T0_MAT[3]
    };
    DEVICE_CREATE_ONCE();
    LPC2478_Timer0_Require(&settings);
    Timer_Generic_Create("Timer0", "Timer0");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Timer1_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Timer1 drivers, but don't set any capture sources or
 *      match registers.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Timer1_Require(void)
{
    static const T_LPC2478_Timer_Settings settings = {
            GPIO_NONE,      // T1_CAP[0]
            GPIO_NONE,      // T1_CAP[1]
            GPIO_NONE,      // T1_MAT[0]
            GPIO_NONE,      // T1_MAT[1]
            GPIO_NONE,      // T1_MAT[2]
            GPIO_NONE,      // T1_MAT[3]
    };
    DEVICE_CREATE_ONCE();
    LPC2478_Timer1_Require(&settings);
    Timer_Generic_Create("Timer1", "Timer1");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Timer2_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Timer2 drivers, but don't set any capture sources or
 *      match registers.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Timer2_Require(void)
{
    static const T_LPC2478_Timer_Settings settings = {
            GPIO_NONE,      // T2_CAP[0]
            GPIO_NONE,      // T2_CAP[1]
            GPIO_NONE,      // T2_MAT[0]
            GPIO_NONE,      // T2_MAT[1]
            GPIO_NONE,      // T2_MAT[2]
            GPIO_NONE,      // T2_MAT[3]
    };
    DEVICE_CREATE_ONCE();
    LPC2478_Timer2_Require(&settings);
    Timer_Generic_Create("Timer2", "Timer2");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Timer3_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Timer3 drivers, but don't set any capture sources or
 *      match registers.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Timer3_Require(void)
{
    static const T_LPC2478_Timer_Settings settings = {
            GPIO_NONE,      // T3_CAP[0]
            GPIO_NONE,      // T3_CAP[1]
            GPIO_NONE,      // T3_MAT[0]
            GPIO_NONE,      // T3_MAT[1]
            GPIO_NONE,      // T3_MAT[2]
            GPIO_NONE,      // T3_MAT[3]
    };
    DEVICE_CREATE_ONCE();
    LPC2478_Timer3_Require(&settings);
    Timer_Generic_Create("Timer3", "Timer3");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Speaker_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Speaker device driver
 *---------------------------------------------------------------------------*/
void UEZPlatform_Speaker_Require(void)
{
    const T_ToneGenerator_Generic_Timer_Settings settings = {
            "Timer3",
            0, // MAT3[0]
            GPIO_P2_26,
            0, // 0 mux = GPIO
            2, // 3 mux = T3_MAT0
    };

    DEVICE_CREATE_ONCE();
    UEZPlatform_Timer3_Require();
    ToneGenerator_Generic_Timer_Create("Speaker", &settings);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_IRTC_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the internal RTC device driver.  Not compatible with the
 *      external RTC.
 *---------------------------------------------------------------------------*/
void UEZPlatform_IRTC_Require(void)
{
    T_uezDevice rtcDev;
    DEVICE_RTC **p_rtcDev;
    const T_uezTimeDate resetTD = {
        {   0, 0, 0}, // 12:00 midnight
        {   1, 1, 2009}, // Jan 1, 2009
    };
    T_uezError error;

    DEVICE_CREATE_ONCE();

