FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_LPC2478/CARRIER_LPC2478.c
   LPC2478_PWM1_Require();
   // Current UEZGUI does not use these, but may need one later
   //LPC2478_PWM1_1_Require(pin?);
   //LPC2478_PWM1_2_Require(pin?);
   //LPC2478_PWM1_3_Require(pin?);
   //LPC2478_PWM1_4_Require(pin?);
   //LPC2478_PWM1_5_Require(pin?);
   //LPC2478_PWM1_6_Require(pin?);
   //LPC2478_PWM1_CAP0_Require(pin?);
   //LPC2478_PWM1_CAP1_Require(pin?);
   PWM_Generic_Create("PWM1", "PWM1");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Touchscreen_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the touchscreen and touch sensitivity for four wire resistive
 *---------------------------------------------------------------------------*/
void UEZPlatform_Touchscreen_Require(void)
{
    T_uezDevice ts;

    const TS_FourWireTouchResist_Configuration tsConfig = {
            // XPlus ADC = ADC0.0 / P0.23
            { "ADC0",   0,  GPIO_P0_23,     0,      1 },
            // XMinus GPIO = P0.25
            { GPIO_P0_25 },
            // YPlus ADC = ADC0.1 / P0.24
            { "ADC0",   1,  GPIO_P0_24,     0,      1 },
            // YMinus GPIO = P0.26
            { GPIO_P0_26 },
            // Use IRQs?
            EFalse,
            // Need input buffer disabled when doing A/Ds?
            ETrue,
    };

    DEVICE_CREATE_ONCE();


    LPC2478_GPIO0_Require();
    UEZPlatform_ADC0_0_Require();
    UEZPlatform_ADC0_1_Require();

    Touchscreen_FourWireTouchResist_Create("Touchscreen", &tsConfig);
    UEZDeviceTableFind("Touchscreen", &ts);
    //UEZTSSetTouchDetectSensitivity(ts, DEFAULT_TOUCHSCREEN_LOW_LEVEL, DEFAULT_TOUCHSCREEN_HIGH_LEVEL);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_USBDevice_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the USBDevice controller.
 *---------------------------------------------------------------------------*/
void UEZPlatform_USBDevice_Require(void)
{
    const T_LPC2478_USBDevice_Settings portBSettings = {
            GPIO_P1_30,     // USB_VBUS2        = USB2_VBUS
            GPIO_P0_31,     // USB_D+2          = USB2_DP
            GPIO_NONE,      // USB_D-2          = USB2_DM (not a GPIO port pin)
            GPIO_P0_14,     // USB_CONNECT2n    = USB2_CON
            GPIO_P0_13,     // USB_UP_LED2      = P0.13_USB2_UPLED_AD0.7
    };
    DEVICE_CREATE_ONCE();

    LPC2478_USBDevice_PortB_Require(&portBSettings);
    USBDevice_LPC2478_Create("USBDevice", "USBDeviceController");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_EMAC_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the EMAC controller for networking.
 *---------------------------------------------------------------------------*/
void UEZPlatform_EMAC_Require(void)
{
    // This EMAC is RMII (less pins)
    const T_LPC2478_EMAC_Settings emacSettings = {
            GPIO_P1_4,      // ENET_TX_ENn      = P1.4_ENET_TXEN
            GPIO_NONE,      // ENET_TX_TXD[3]   = not used for RMII
            GPIO_NONE,      // ENET_TX_TXD[2]   = not used for RMII
            GPIO_P1_1,      // ENET_TX_TXD[1]   = P1.1_ENET_TXD1
            GPIO_P1_0,      // ENET_TX_TXD[0]   = P1.0_ENET_TXD0
            GPIO_NONE,      // ENET_TX_ER       = not used for RMII
            GPIO_NONE,      // ENET_TX_CLK      = not used for RMII
            GPIO_NONE,      // ENET_RX_DV       = not used for RMII
            GPIO_NONE,      // ENET_RXD[3]      = not used for RMII
            GPIO_NONE,      // ENET_RXD[2]      = not used for RMII
            GPIO_P1_10,     // ENET_RXD[1]      = P1.10_ENET_RXD1
            GPIO_P1_9,      // ENET_RXD[0]      = P1.9_ENET_RXD0
            GPIO_P1_14,     // ENET_RX_ER       = P1.14_ENET_RX_ER
            GPIO_P1_15,     // ENET_REFCLK      = P1.15_ENET_REFCLK
            GPIO_NONE,      // ENET_COL         = not used for RMII
            GPIO_P1_8,      // ENET_CRS         = P1.8_ENET_CRSDV
            GPIO_P1_16,     // ENET_MDC         = P1.16_ENET_MDC
            GPIO_P1_17,     // ENET_MDIO        = P1.17_ENET_MDIO
    };
    DEVICE_CREATE_ONCE();

    LPC2478_EMAC_RMII_Require(&emacSettings);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_WiredNetwork0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the networking for Wired connections.
 *---------------------------------------------------------------------------*/
void UEZPlatform_WiredNetwork0_Require(void)
{
    DEVICE_CREATE_ONCE();

    // Wired network needs an EMAC
    UEZPlatform_EMAC_Require();

    // Create the network driver for talking to lwIP on a wired
    // network.
    Network_lwIP_Create("WiredNetwork0");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_I2S_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the I2S drivers for talking to the expansion board.
 *---------------------------------------------------------------------------*/
#if UEZ_ENABLE_I2S_AUDIO
void UEZPlatform_I2S_Require(void)
{
    static const T_LPC2478_I2S_Settings settings = {
            GPIO_P0_6,  // I2S_RX_SDA   = P0.6_I2SRX_SDA_SSEL1_MAT2.0
            GPIO_P0_4,  // I2S_RX_SCK   = P0.4_I2SRX_CLK_RD2_CAP2.0
            GPIO_P0_5,  // I2S_RX_WS    = P0.5_I2SRX_WS_TD2_CAP2.1
            GPIO_NONE,  // I2S_RX_MCLK  = not used

            GPIO_P0_9,  // I2S_TX_SDA   = P0.9_I2STX_SDA_MOSI1_MAT2.3
            GPIO_P0_7,  // I2S_TX_SCK   = P0.7_I2STX_CLK_SCK1_MAT2.1
            GPIO_P0_8,  // I2S_TX_WS    = P0.8_I2STX_WS_MISO1_MAT2.2
            GPIO_NONE,  // I2S_TX_MCLK  = not used
    };
    DEVICE_CREATE_ONCE();
    LPC2478_I2S_Require(&settings);
    Generic_I2S_Create("I2S", "I2S");
}
#endif
/*---------------------------------------------------------------------------*
 * Routine:  uEZPlatformInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize the board with all the proper settings.
 *      Registers all peripherals specific to this board.
 *---------------------------------------------------------------------------*/
void uEZPlatformInit(void)
{
    // Do any initialiation necessary before the RTOS is started
}

/*---------------------------------------------------------------------------*
 * Routine:
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the networking for Wired connections.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Button_Require(void)
{
    T_uezDeviceWorkspace *p_button0;
    T_uezDevice i2c0;
    T_uezDeviceWorkspace *p_i2c0;

    DEVICE_CREATE_ONCE();

